guy bolongaro : [customer connecting with agent - disregard]
guy bolongaro : hi, i'm trying to set up photoshop on my new mac book pro but its saying installation error ...
BOT : Hi. I am the Adobe Virtual Assistant. How can I help?
BOT : You need help with a download or install error code. Is that right?
guy bolongaro : Yes
BOT : Tell me which error code you need help with.
guy bolongaro : no code shown
BOT : You might find the help you need at https://community.adobe.com/t5/download-install-discussions/hi-i-m-trying-to-download-my-photoshop-on-my-mac-and-it-isn-t-working/td-p/7712517
BOT : If that doesn't help, you can search common download/install errors and solutions at adobe.com/go/error-codes
BOT : Did that help?
guy bolongaro : No
BOT : Let's find another way to get you the help you need.
BOT : How would you like to proceed?
guy bolongaro : Chat with an agent
BOT : Ok. Transferring you to an agent who can help. They'll be able to pick up our chat where we've left off.
BOT : While you wait, please help your agent solve this issue quickly by installing and running the Creative Cloud Log Collector tool at adobe.com/go/logcollector
CUSTOM_SYSTEM_MESSAGE : Your estimated wait time is currently less than one minute
CUSTOM_SYSTEM_MESSAGE : You are now connected to Sumangal, who is reviewing your account. If you need to share sensitive information, such as credit card number, please wait for your agent to give you steps to share it securely.
Sumangal : Hello, I’d be happy to help you today, let me first pull up your account information and access your details.  
guy bolongaro : ok thnaks
Sumangal : Thank you for your patience, please share the error code you see there. 
guy bolongaro : no error code juts saying installation error
guy bolongaro : "an error occured during installation"
guy bolongaro : trying to install photoshop on my macbook pro
Sumangal : Alright. Click on more info and let me know if you see any error code. 
guy bolongaro : no option for more info
Sumangal : Is it OK if I access your computer remotely to assist you with your issue? If yes, please close your personal files and folders. Let me know when you're ready to start the remote session.
guy bolongaro : yes please
guy bolongaro : ok ready
guy bolongaro : ok...
Sumangal : https://screen.share.adobe.com/?ak=3ba763b8904fb1505d29dcd1b74fb663

1.Click or  Copy the link and open it in a new browser tab.
2. Download, Save, and then Run the Bomgar setup on your machine.
3. Agree to the License Agreement and Screen Recording.
4. When the Bomgar window opens, click on "Allow" to start sharing.
guy bolongaro : saying error starting client
Sumangal : Does it say network error? 
guy bolongaro : wont allow me to download the support thing ...error starting client
Sumangal : Seems like an issue with the Mac. Do you have any VPN or antivirus enabled? 
guy bolongaro : it up right now..brand new
guy bolongaro : setting it up
Sumangal : I see. Are you connected with the work or personal network? 
guy bolongaro : what is that?
Sumangal : The internet which is being used on your Mac
guy bolongaro : yes of course ... that how i.m talking to you!
Sumangal : Yes, please let me know if it is personal or work network. 
guy bolongaro : going to retsart mac ...will be back soon ..